W4D5/music_app_with_tests/app/controllers/albums_controller.rb

    def new
        @bands = Band.all
        @band = Band.find_by(id: params[:band_id])
---
SELECT "bands".* FROM "bands"
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def create
        @album = Album.new(album_params)
        @band = Band.find_by(id: @album.band_id)
        if @album.save
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "albums" ("title", "year", "is_live", "created_at", "updated_at", "band_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "asdf"], ["year", 2019], ["is_live", true], ["created_at", "2019-04-04 21:10:46.809373"], ["updated_at", "2019-04-04 21:10:46.809373"], ["band_id", 2]]

    def edit
        @bands = Band.all
        @album = Album.find_by(id: params[:id])
---
SELECT "bands".* FROM "bands"
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def destroy
        @album = Album.find_by(id: params[:id])
        Album.delete(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 3]]