W4D5/music_app_with_tests/app/controllers/application_controller.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "vz2tV5iGSuECYrbKFNSxSg"], ["updated_at", "2019-04-04 17:58:00.088129"], ["id", 2]]
---
    def log_in_user!(user)
        user.session_token = SecureRandom::urlsafe_base64
        session[:session_token] = user.session_token
        user.save!