W4D5/music_app_with_tests/app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Shine"], ["updated_at", "2019-04-04 19:03:35.155217"], ["id", 4]]
---
    def update
        @band = Band.find_by(id: params[:id])
        if @band.update_attributes(band_params)

DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]
---
    def destroy
        Band.destroy(params[:id])