W4D5/music_app_with_tests/app/controllers/notes_controller.rb

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "notes" ("field", "user_id", "track_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["field", "fdasf"], ["user_id", 5], ["track_id", 2], ["created_at", "2019-04-04 23:41:37.614033"], ["updated_at", "2019-04-04 23:41:37.614033"]]
---
    def create
        @note = Note.new(note_params)
        @note.user_id = current_user.id
        @track = Track.find_by(id: @note.track_id)
        if @note.save

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        @note = Note.find_by(id: params[:id])
        @track = Track.find_by(id: @note.track_id)

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 2]]
---
    def destroy
        @note = Note.find_by(id: params[:id])
        if current_user.id == @note.user_id
            Note.delete(params[:id])