W4D5/music_app_with_tests/app/controllers/tracks_controller.rb

SELECT "albums".* FROM "albums"
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
    def new
        @albums = Album.all
        @album = Album.find_by(id: params[:album_id])

INSERT INTO "tracks" ("title", "ord", "lyrics", "album_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "dfsaf"], ["ord", 1], ["lyrics", "12"], ["album_id", 9], ["created_at", "2019-04-04 22:05:43.014723"], ["updated_at", "2019-04-04 22:05:43.014723"]]
---
    def create
        @track = Track.new(track_params)
        if @track.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @album = Album.find_by(id: params[:album_id])
        @track = Track.find_by(id: params[:id])

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 2]]
---
    def destroy
        @track = Track.find_by(id: params[:id])
        Track.delete(params[:id])