W4D5/music_app_with_tests/app/views/notes/_note.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
<br>
Authored by: <%= User.find_by(id: note.user_id).email  %>