W4D5/music_app_with_tests/app/views/albums/show.html.erb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 9]]
---
<h2>Track List</h2>
<% @album.tracks.each do |track| %>